# from https://doi.org/10.1007/s00371-019-01673-y

[net]
window=60
step=3

[convolutional]
batch_normalize = 1
filters=64
size=10
stride=1
pad=1
activation=relu

[maxpool]
size = 2
stride = 2

[convolutional]
batch_normalize = 1
filters=32
size=5
stride=1
pad=1
activation=relu

[maxpool]
size = 2
stride = 2

[convolutional]
batch_normalize = 1
filters=12
size=5
stride=1
pad=1
activation=relu

[maxpool]
size = 3
stride = 3

[connected]
output=60
activation=linear

[convolutional]
batch_normalize = 1
filters=12
size=5
stride=1
pad=1
activation=relu

[upsample]
size=3
stride=3

[convolutional]
batch_normalize = 1
filters=32
size=5
stride=1
pad=1
activation=relu

[upsample]
size=2
stride=2

[convolutional]
batch_normalize = 1
filters=64
size=10
stride=1
pad=1
activation=relu

[cost]
type=mse




